#Include "Rwmake.ch"
#Include "TOPCONN.ch"
/*_______________________________________________________________________________
¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦
¦¦+-----------+------------+-------+----------------------+------+------------+¦¦
¦¦¦ Função    ¦ MT250EST   ¦ Autor ¦  ¦ Data ¦  ¦¦¦
¦¦+-----------+------------+-------+----------------------+------+------------+¦¦
¦¦¦ Descriçäo ¦ Ponto de entrada de utilizado no estorno da Produção.         ¦¦¦
¦¦¦           ¦                                 ¦¦¦
¦¦+-----------+---------------------------------------------------------------+¦¦
¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦
¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯*/
User Function MT250EST()

	Local aArea := GetArea()

	If !EMPTY(SD3->D3_XSEQUEN) 
		cQuery := " UPDATE "+RetSQLName("SZ1")+" " 
		cQuery += " SET D_E_L_E_T_ = '*' 
		cQuery += " WHERE Z1_FILIAL='"+XFILIAL("SZ1")+"' AND "
		cQuery += " Z1_OP ='"+SUBSTRING(SD3->D3_OP,1,11)+"' AND Z1_CHASSIS = '"+SD3->D3_XSEQUEN+"' AND D_E_L_E_T_=''" 


		TCSQLExec(cQuery)
	EndIf  
	RestArea(aArea)
Return(.T.) 