#Include "Rwmake.ch"

/*_______________________________________________________________________________
¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦
¦¦+-----------+------------+-------+----------------------+------+------------+¦¦
¦¦¦ Função    ¦ SF1100E    ¦ Autor ¦ ADRIANO LIMA         ¦ Data ¦ 17/04/2012 ¦¦¦
¦¦+-----------+------------+-------+----------------------+------+------------+¦¦
¦¦¦ Descriçäo ¦ Ponto de Entrada de exclusão da nota de entrada (cabeçalho)   ¦¦¦
¦¦+-----------+---------------------------------------------------------------+¦¦
¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦
¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯*/
User Function SF1100E()
	Local cBusca := SZW->(XFILIAL("SZW"))+SF1->(F1_DOC+F1_SERIE+F1_FORNECE+F1_LOJA)
	
	SZW->(dbSetOrder(4))
	SZW->(dbSeek(cBusca,.T.))
	While !SZW->(Eof()) .And. cBusca == SZW->(ZW_FILIAL+ZW_DOC+ZW_SERIE+ZW_FORNECE+ZW_LOJA)
		
		RecLock("SZW",.F.)
		SZW->(dbDelete())
		MsUnLock()
		
		SZW->(dbSkip())
	Enddo
	
Return